Documents/ВводУсловийИпотечногоКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВводУсловийИпотечногоКредитования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияИпотечногоКредитования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Программа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрограммыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеРасходы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйРазмерКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальныйРазмерКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВидыДополнительныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ВидыДополнительныхРасходов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДополнительныхРасходов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводУсловийИпотечногоКредитования/Forms/ФормаВводаМногострочногоЗначения/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	ВладелецФормы.ДополнительныеРасходыОбработкаВыбора(ДополнительныеРасходы);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ФормаНастроекВидовДопРасходов = ПолучитьФорму("РегистрСведений.ВидыДополнительныхРасходов.ФормаСписка");
	ФормаНастроекВидовДопРасходов.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьКнопкиВидов();
КонецПроцедуры

&НаСервере
Процедура СформироватьКнопкиВидов()

	КоличествоРядов = 5;

	Кнопки = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДополнительныхРасходов.ВидДополнительныхРасходов КАК Представление
		|ИЗ
		|	РегистрСведений.ВидыДополнительныхРасходов КАК ВидыДополнительныхРасходов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВсегоЗначений = ВыборкаДетальныеЗаписи.Количество();
	
	Ряд = 1;
	i = 1;  	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ряд = ?(Ряд>КоличествоРядов,1,Ряд);
		Наименование = ВыборкаДетальныеЗаписи.Представление;
		ДобавитьКнопку(Наименование, i, Кнопки, Ряд);
		Ряд=Ряд+1;
		i=i+1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопку(Наименование,ПорядковыйНомер, Кнопки, Ряд)

	ПрефиксКоманды = "КомандаВид";
	
	ИмяКоманды = ПрефиксКоманды + ПорядковыйНомер;
	НоваяКоманда = ЭтаФорма.Команды.Найти(ИмяКоманды) ;
	Если НоваяКоманда = Неопределено Тогда
		Попытка
			НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	НоваяКоманда.Действие = "Команда";
	        	
	ЭлементРодительСтр = "Родитель" + ПрефиксКоманды+ Ряд;
	ЭлементРодитель = Элементы.Найти(ЭлементРодительСтр);
	Если ЭлементРодитель = Неопределено Тогда
		  ЭлементРодитель = Элементы.Добавить(ЭлементРодительСтр, Тип("ГруппаФормы"),Элементы["Родитель" + ПрефиксКоманды]);
		  ЭлементРодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		  ЭлементРодитель.Отображение = ОтображениеОбычнойГруппы.Нет;
		  ЭлементРодитель.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	

	НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"),ЭлементРодитель);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	НовыйЭлемент.Заголовок = Наименование;
	ШиринаЗаголовка = Макс(СтрДлина(Наименование),1);
	ЧестнаяШирина = ШиринаЗаголовка*2 / Pow(ШиринаЗаголовка,0.3);
	НовыйЭлемент.Ширина = ?(Ширина=0, ЧестнаяШирина,Макс(ЧестнаяШирина,Ширина));
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = Наименование;
	НовыйЭлемент.ВысотаЗаголовка = 1;
	НовыйЭлемент.РастягиватьПоГоризонтали  = Ложь;
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	                                              	
	НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
	                                              	
КонецПроцедуры


&НаКлиенте
Процедура Команда()
	Значение = ЭтаФорма.ТекущийЭлемент.Заголовок + ", ";
	Элементы.ДополнительныеРасходы.ВыделенныйТекст = Значение;
	ЭтаФорма.ТекущийЭлемент = Элементы.ДополнительныеРасходы;
КонецПроцедуры
